stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/STEVAL-ESL1KCB/Applications/BLE/BLE_ESL/STM32_BLE/App/app_ble.c
        /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }
      gap_cmd_resp_release();
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */

      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      ESLHandleNotification.EvtOpcode = ESL_DISCON_HANDLE_EVT;
      ESLHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      ESL_APP_EvtRx(&ESLHandleNotification);
      DISHandleNotification.EvtOpcode = DIS_DISCON_HANDLE_EVT;
      DISHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      DIS_APP_EvtRx(&DISHandleNotification);
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */
      /* USER CODE END EVT_DISCONN_COMPLETE */
    }
    break;

  case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (hci_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
      case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      INT(p_conn_update_complete->Connection_Interval*1.25),
                      FRACTIONAL_2DIGITS(p_conn_update_complete->Connection_Interval*1.25),
                      p_conn_update_complete->Peripheral_Latency,
                      p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(p_conn_update_complete);
          ESL_connected = true;
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
        }
        break;
      case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
          p_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          UNUSED(p_le_phy_update_complete);

          gap_cmd_resp_release();

          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
        }
        break;
      case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_conn_complete;
          p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG("HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE\n");
          connection_complete_event(p_enhanced_conn_complete->Status,
                                    p_enhanced_conn_complete->Connection_Handle,
				    p_enhanced_conn_complete->Peer_Address_Type,
                                    p_enhanced_conn_complete->Peer_Address,
                                    p_enhanced_conn_complete->Connection_Interval,
                                    p_enhanced_conn_complete->Peripheral_Latency,
                                    p_enhanced_conn_complete->Supervision_Timeout,
                                    0xFFFF);    // No Sync_Handle
        }
        break;        
      case HCI_LE_ENHANCED_CONNECTION_COMPLETE_V2_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_v2_event_rp0 *p_enhanced_conn_complete_v2;
          p_enhanced_conn_complete_v2 = (hci_le_enhanced_connection_complete_v2_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG("HCI_LE_ENHANCED_CONNECTION_COMPLETE_V2_SUBEVT_CODE\n");
          connection_complete_event(p_enhanced_conn_complete_v2->Status,
                                    p_enhanced_conn_complete_v2->Connection_Handle,
                                    p_enhanced_conn_complete_v2->Peer_Address_Type,
                                    p_enhanced_conn_complete_v2->Peer_Address,
                                    p_enhanced_conn_complete_v2->Connection_Interval,
                                    p_enhanced_conn_complete_v2->Peripheral_Latency,
                                    p_enhanced_conn_complete_v2->Supervision_Timeout,
                                    p_enhanced_conn_complete_v2->Sync_Handle);
        }
        break;
      case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG("HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE\n");
          connection_complete_event(p_conn_complete->Status,
                                    p_conn_complete->Connection_Handle,
                                    p_conn_complete->Peer_Address_Type,
                                    p_conn_complete->Peer_Address,
                                    p_conn_complete->Connection_Interval,
                                    p_conn_complete->Peripheral_Latency,
                                    p_conn_complete->Supervision_Timeout,
                                    0xFFFF);    // No Sync_Handle
        }
        break;
      /* USER CODE BEGIN EVT_LE_META_EVENT_1 */
        
      case HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_V2_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_sync_transfer_received_v2_event_rp0 *p_periodic_adv_sync_transfer_rec_v2;
          p_periodic_adv_sync_transfer_rec_v2 = (hci_le_periodic_advertising_sync_transfer_received_v2_event_rp0 *) p_meta_evt->data;
          
          APP_DBG_MSG("HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_V2\n");
          
          if(p_periodic_adv_sync_transfer_rec_v2->Status == 0)
          {
            bleAppContext.Device_Connection_Status = APP_BLE_SYNC;
            ESL_APP_SyncInfoReceived(p_periodic_adv_sync_transfer_rec_v2->Sync_Handle);
            
            ESL_synchronized = true;
            ESL_DISPLAY_SetState(ESL_STATE_SYNC);
            ESL_DISPLAY_Show();
          }
          else
          {
            APP_DBG_MSG("Status %02X\n", p_periodic_adv_sync_transfer_rec_v2->Status);
          }
        }
        break;
        
      case HCI_LE_PERIODIC_ADVERTISING_REPORT_V2_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_report_v2_event_rp0 *p_periodic_adv_report_v2;
          p_periodic_adv_report_v2 = (hci_le_periodic_advertising_report_v2_event_rp0 *)p_meta_evt->data;
          
          /* While in the Updating state, the ESL shall ignore any data present 
             on the LE periodic advertising with responses logical transport. */
          if(ESL_APP_Get_ESL_State() != ESL_STATE_UPDATING)
          {  
            if(p_periodic_adv_report_v2->Data_Status == HCI_PADV_DATA_STATUS_COMPLETE && p_periodic_adv_report_v2->Data_Length != 0)
            {
              ESL_APP_AdvPayloadReceived(p_periodic_adv_report_v2->Periodic_Event_Counter, p_periodic_adv_report_v2->Data, p_periodic_adv_report_v2->Data_Length);
            }          
          }  
          watchdog_refresh();
        }
        break;
        
      case HCI_LE_PERIODIC_ADVERTISING_SYNC_LOST_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_sync_lost_event_rp0 *p_periodic_adv_sync_lost_event;
          p_periodic_adv_sync_lost_event = (hci_le_periodic_advertising_sync_lost_event_rp0 *)p_meta_evt->data;
          UNUSED(p_periodic_adv_sync_lost_event);
          
