stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/STEVAL-ESL1KCB/Applications/BLE/BLE_ESL/STM32_BLE/App/app_ble.c
static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */

static void lowPowerAdv(void *arg)
{
  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_LP);
  
  return;
}

static void convert_byte_to_ascii_hex(uint8_t byte, char *s)
{
  uint8_t nibble_1 = ((byte & 0xF0)>>4);
  uint8_t nibble_0 = byte & 0xF;
  
  if(nibble_1 >= 0x0A)
  {
    s[0] = nibble_1 - 0x0A + 'A';
  }
  else
  {
    s[0] = nibble_1 + '0';
  }
  
  if(nibble_0 >= 0x0A)
  {
    s[1] = nibble_0 - 0x0A + 'A';
  }
  else
  {
    s[1] = nibble_0 + '0';
  }  
}

static void fill_localName(char * name, const uint8_t* p_bd_addr)
{
  for(uint8_t i = 0; name[i] != '\0' ;i++)
  {
    if(i > 0 && name[i - 1] == 'X' && name[i] == 'X')
    {
      convert_byte_to_ascii_hex(p_bd_addr[0], &name[i - 1]);
      break;
    }
  }    
}

static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t* p_bd_addr)
{
  uint16_t i =0;
  uint8_t ad_length, ad_type;  
  
  while(i < tab_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
      
    switch (ad_type)
    {
    case AD_TYPE_COMPLETE_LOCAL_NAME:
      {        
        if((p_adv_data[i + ad_length] == 'X') && (p_adv_data[i + ad_length - 1] == 'X'))
        {
          convert_byte_to_ascii_hex(p_bd_addr[0], (char *)&p_adv_data[i + ad_length - 1]);
        }
      }
      break;
    default:
      break;
    }
    i += ad_length + 1; /* increment the iterator to go on next element*/
  }
}
/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

void ESL_DEVICE_ProcessRequest(void)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_ESL_UPD, CFG_SEQ_PRIO_0);
}

void watchdog_enable(void)
{
#ifndef DISABLE_WATCHDOG
  __HAL_RCC_WDG_CLK_ENABLE();
  HAL_IWDG_Refresh(&hiwdg);
#endif
}

void watchdog_disable(void)
{
#ifndef DISABLE_WATCHDOG
  HAL_IWDG_Refresh(&hiwdg);
  __HAL_RCC_WDG_CLK_DISABLE();
#endif
}

void watchdog_refresh(void)
{
#ifndef DISABLE_WATCHDOG
  HAL_IWDG_Refresh(&hiwdg);
#endif
}

#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if(APPE_ButtonIsLongPressed(B1))
  {
    ESL_DISPLAY_Clear();
    return;
  } 
  
  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE || bleAppContext.Device_Connection_Status == APP_BLE_ADV_LP)
  {
     /* Relaunch fast advertising */
    
    if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
    {
      watchdog_enable();
      ESL_DISPLAY_SetState(ESL_STATE_ADV);
      ESL_DISPLAY_Show();
    }
    
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
  }

  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
